show databases;
use ra_db;
drop database ra_db;
create database ra_db;
show tables ;

drop table bike_garage;
select * from bike_garage;
delete from bike_garage;

# 권한 테이블 데이터 추가
insert into authority(authority_name)
values ("ROLE_RA_Member"),("ROLE_CREW_Master"),("ROLE_CREW_Named"),("ROLE_CREW_Member"),("ROLE_RA_ADMIN");
select * from authority;





select * from bike_model;

delete from bike_model;

# 유저 테이블 데이터 추가
insert into user(user_nickname,user_name,user_birthday,user_gender,
                 user_phone,user_email,user_state,user_password,user_context,user_regdate,authority_id)
values ("관리1","이름1","20231231",true,"010-1111-1234","test1@naver.com","라이딩중","1234","자기소개1","2024-02-14T09:30:00",5),
       ("별명2","이름2","20231231",false,"010-1111-1234","test2@naver.com","치료중","1234","자기소개2","2024-02-14T09:30:00",1),
       ("별명3","이름3","20231231",true,"010-1111-1234","test3@naver.com","시즌종료","1234","자기소개3","2024-02-14T09:30:00",1),
       ("별명4","이름4","20231231",false,"010-1111-1234","test4@naver.com","치료중","1234","자기소개4","2024-02-14T09:30:00",1),
       ("별명5","이름5","20231231",false,"010-1111-1234","test5@naver.com","라이딩중","1234","자기소개5","2024-02-14T09:30:00",1),
       ("별명6","이름6","20231231",false,"010-1111-1234","test6@naver.com","시즌종료","1234","자기소개6","2024-02-14T09:30:00",1),
       ("별명7","이름7","20231231",true,"010-1111-1234","test7@naver.com","시즌종료","1234","자기소개7","2024-02-14T09:30:00",1),
       ("별명8","이름8","20231231",true,"010-1111-1234","test8@naver.com","라이딩중","1234","자기소개8","2024-02-14T09:30:00",1),
       ("별명9","이름9","20231231",true,"010-1111-1234","test9@naver.com","라이딩중","1234","자기소개9","2024-02-14T09:30:00",1);

select * from user;
delete from user;
delete from bike_garage;

# 🛠️ 지역 테이블 영역
select * from address;
drop table address;
insert into address(address_id, city, town)
values (1,"서울","종로구"),(2,"서울","중구"),(3,"서울","용산구"),(4,"서울","성동구"),(5,"서울","광진구"),
(6,"서울","동대문구"),(7,"서울","중랑구"),(8,"서울","성북구"),(9,"서울","강북구"),(10,"서울","도봉구"),
(11,"서울","노원구"),(12,"서울","은평구"),(13,"서울","서대문구"),(14,"서울","마포구"),(15,"서울","양천구"),
(16,"서울","강서구"),(17,"서울","구로구"),(18,"서울","금천구"),(19,"서울","영등포구"),(20,"서울","동작구"),
(21,"서울","관악구"),(22,"서울","서초구"),(23,"서울","강남구"),(24,"서울","송파구"),(25,"서울","강동구"),
(26,"경기","가평"),(27,"경기","과천"),(28,"경기","광주"),(29,"경기","군포"),(30,"경기","남양주"),
(31,"경기","부천"),(32,"경기","수원"),(33,"경기","안산"),(34,"경기","안양"),(35,"경기","양평"),
(36,"경기","연천"),(37,"경기","용인"),(38,"경기","의정부"),(39,"경기","파주"),(40,"경기","포천"),
(41,"경기","화성"),(42,"경기","고양"),(43,"경기","광명"),(44,"경기","구리"),(45,"경기","김포"),
(46,"경기","동두천"),(47,"경기","성남"),(48,"경기","시흥"),(49,"경기","안성"),(50,"경기","양주"),
(51,"경기","여주"),(52,"경기","오산"),(53,"경기","의왕"),(54,"경기","이천"),(55,"경기","평택"),
(56,"경기","하남"),(57,"충북","제천"),(58,"충북","충주"),(59,"충북","단양"),(60,"충북","괴산"),
(61,"충북","음성"),(62,"충북","진천"),(63,"충북","청주"),(64,"충북","보은"),(65,"충북","옥천"),
(66,"충북","영동"),(67,"충북","증평"),(68,"충남","태안"),(69,"충남","서산"),(70,"충남","당진"),
(71,"충남","예산"),(72,"충남","홍성"),(73,"충남","청양"),(74,"충남","보령"),(75,"충남","서천"),
(76,"충남","부여"),(77,"충남","논산"),(78,"충남","금산"),(79,"충남","계룡"),(80,"충남","공주"),
(81,"충남","아산"),(82,"충남","천안"),(83,"강원","철원"),(84,"강원","화천"),(85,"강원","양구"),
(86,"강원","고성"),(87,"강원","인제"),(88,"강원","속초"),(89,"강원","양양"),(90,"강원","홍천"),
(91,"강원","횡성"),(92,"강원","원주"),(93,"강원","평창"),(94,"강원","강릉"),(95,"강원","정선"),
(96,"강원","영월"),(97,"강원","동해"),(98,"강원","삼척"),(99,"강원","태백"),(100,"경북","울릉"),
(101,"경북","울진"),(102,"경북","봉화"),(103,"경북","영주"),(104,"경북","예천"),(105,"경북","문경"),
(106,"경북","상주"),(107,"경북","구미"),(108,"경북","김천"),(109,"경북","성주"),(110,"경북","고령"),
(111,"경북","칠곡"),(112,"경북","의성"),(113,"경북","안동"),(114,"경북","영양"),(115,"경북","영덕"),
(116,"경북","청송"),(117,"경북","포항"),(118,"경북","영천"),(119,"경북","경주"),(120,"경북","경산"),
(121,"경북","청도"),(122,"경남","함양"),(123,"경남","거창"),(124,"경남","산청"),(125,"경남","하동"),
(126,"경남","합천"),(127,"경남","의령"),(128,"경남","창녕"),(129,"경남","밀양"),(130,"경남","양산"),
(131,"경남","김해"),(132,"경남","함안"),(133,"경남","창원"),(134,"경남","고성"),(135,"경남","진주"),
(136,"경남","사천"),(137,"경남","남해"),(138,"경남","통영"),(139,"경남","거제"),(140,"전북","군산"),
(141,"전북","익산"),(142,"전북","김제"),(143,"전북","부안"),(144,"전북","고창"),(145,"전북","정읍"),
(146,"전북","전주"),(147,"전북","완주"),(148,"전북","진안"),(149,"전북","임실"),(150,"전북","순창"),
(151,"전북","남원"),
(152,"전북","장수"),
(153,"전북","무주"),
(154,"전남","목포"),
(155,"전남","여수"),
(156,"전남","순천"),
(157,"전남","나주"),
(158,"전남","광양"),
(159,"전남","담양"),
(160,"전남","곡성"),
(161,"전남","구례"),
(162,"전남","고흥"),
(163,"전남","보성"),
(164,"전남","화순"),
(165,"전남","장흥"),(166,"전남","강진"),(167,"전남","해남"),(168,"전남","영암"),(169,"전남","무안"),
(170,"전남","함평"),(171,"전남","영광"),(172,"전남","장성"),(173,"전남","완도"),(174,"전남","진도"),(175,"전남","신안")
